#include <windows.h>
#include <iostream>
#include <stdlib.h>
#include <time.h>
using namespace std;

/* Оптимизация:
(!) проведя анализ мы решили, что нам нужно изначально броски помещать в цикл и выходить из него если есть победитель, а если нет победителя, то в цикле перебросить.
Берем цикл do_while, т.к. сперва мы все-таки бросим, и только если ничья, то перебросим. А перед фразой про ничью и переброску мы вставим броски пирата и корсара с дву-
мя switch (вместо 4-х). */

int main()
{
    SetConsoleOutputCP(1251);
    srand(time(NULL));
    int cash = 0, bet = 0, strike_pc = 0, strike_player = 0, level = 0, dice_pc = 0, dice_pl = 0, change_pc = 0, change_pl = 0, N = 9;

    cout << "\n\tМатрос: \"Вижу землю, Капитан! Таверну!\" " << endl;
    Sleep(3000);

    // Краша
    for (int i = 0; i < N; i++)																								// цикл по строкам
    {
        for (int j = 0; j < N; j++)																							// цикл по столбцам
        {
            if (N % 2 == 0)																									// если ширина четная
            {
                if ((i == 3 * N / 4 - 1 || i == 3 * N / 4 + 1) && (j == N / 2 || j == N / 2 - 1))cout << "  |   ";			// вертикальная рама окошка
                else
                    if (i == 3 * N / 4 && j == N / 2 - 2)cout << " - - -";														// левая центральная рама окошка
                    else
                        if (i == 3 * N / 4 && j == N / 2 + 1)cout << " - -  ";														// правая центральная рама окошка
                        else
                            if (i == 3 * N / 4 && (j == N / 2 || j == N / 2 - 1))cout << " -|- -";										// перекрестия окна
                            else
                                if ((i >= N / 2 - 1 && i <= N / 2 + 2) && (j == N / 2 + 2))cout << "|###| ";								// труба из кирпичей
                                else
                                    if (i >= j && i + j >= N - 1)cout << "|===| ";																// черепица в крыше
                                    else cout << "      ";																						// небо
            }
            else																											// если ширина нечетная
            {
                if ((i == 3 * N / 4 - 1 || i == 3 * N / 4 + 1) && j == N / 2)cout << "  |   ";								// вертикальная рама окошка
                else
                    if (i == 3 * N / 4 && j == N / 2 - 1)cout << " - - -";														// левая центральная рама окошка
                    else
                        if (i == 3 * N / 4 && j == N / 2 + 1)cout << " - -  ";														// правая центральная рама окошка
                        else
                            if (i == 3 * N / 4 && j == N / 2)cout << " -|- -";															// перекрестье окна
                            else
                                if ((i >= N / 2 - 1 && i <= N / 2 + 2) && (j == N / 2 + 2))cout << "|###| ";								// труба из кирпичей
                                else
                                    if (i >= j && i + j >= N - 1)cout << "|===| ";																// черепица в крыше
                                    else cout << "      ";																						// небо
            }
        }
        cout << endl;
    }

    // Стены
    for (int i = 0; i < N; i++)																								// цикл по строкам
    {
        for (int j = 0; j < N; j++)																							// цикл по столбцам
        {
            if ((i >= N / 2 - 1 && i <= N / 2 + 1) && (j == N - 3 || j == N - 4))cout << "  |   ";							// центральные вертикальные рамы
            else
                if ((i >= N / 2 - 1 && i <= N / 2 + 1) && j == N - 2)cout << "    | ";											// правая вертикальная рама
                else
                    if ((i >= N / 2 - 1 && i <= N / 2 + 1) && j == N - 5)cout << "|     ";											// левая вертикальная рама
                    else
                        if ((i == N / 2 - 2 || i == N / 2 + 2) && (j >= N - 5 && j <= N - 2))cout << "- - - ";							// верхняя и нижняя рамы
                        else
                            if (i == 2 && (j == 1 || j == 2))cout << "_ _ _ ";																// верх двери
                            else
                                if (i == N - 1 && j == 1)cout << "|_ _ _";																		// левая половина порога
                                else
                                    if (i == N - 1 && j == 2)cout << " _ _| ";																		// правая половина порога
                                    else
                                        if (i >= 3 && j == 1)cout << "|     ";																			// левая сторона двери
                                        else
                                            if ((i == N / 2 + 1) && j == 2)cout << "  O | ";																// ручка на одну строку ниже середины стены
                                            else
                                                if (i >= 3 && j == 2)cout << "    | ";																			// правая сторона двери
                                                else cout << "|###| ";																							// кирпичи в стене
        }
        cout << endl;
    }
    Sleep(4000);
    cout << "\n\tКапитан: \"Наконец-то мы нашли это место...\" " << endl;
    Sleep(4000);
    cout << "\n\tКапитан: \"Спустить шлюпки!\" " << endl;
    Sleep(4000);
    cout << "\n\tКапитан: \"Корсары, матросы, друзья, слушайте меня! " << endl;
    Sleep(4000);
    cout << "\n\t         \"Все мы доблесно сражались, бились, и еще раз вступали в бой во имя короны!\" " << endl;
    Sleep(4000);
    cout << "\n\t         \"Сегодня же оторвемся! Хватайте распутных девок, эль, ром, играйте в кости.., вечер ваш!\" " << endl;
    Sleep(4000);
    cout << "\n\t         \"Но, отплываем завтра, в полдень! Всем за час до отплытия быть на палубе! Это приказ!\" " << endl;
    Sleep(4000);
    cout << "\n\t         \"А сейчас, все к шлюпкам!\" " << endl;
    Sleep(10000);
    system("cls");
    cout << "--------У Таверны!-------------------------------------------------------------------------------------------------------------------------------\n" << endl;
    cout << "\n\tКорсар Смит: \"Что-то я давно не играл с удачей.\" " << endl;
    Sleep(4000);
    cout << "\n\tКорсар Пэнс: \"Посмотри у бочек, там всегда пираты толпятся. Не советовал бы я тебе туда соваться!\" " << endl;
    Sleep(4000);
    cout << "\n\tКорсар Смит: \"Удача всегда у меня в кармане! Посмотрим чего стоит пиратское отродье!\" " << endl;
    Sleep(10000);
    system("cls");
    cout << "--------У бочек!---------------------------------------------------------------------------------------------------------------------------------\n" << endl;
    cout << "\n\tКорсар Смит: \"Найдется ли тут у вас храбрец, который бы сразился со сной в кости?\" " << endl;
    Sleep(5000);
    cout << "\n\tПират Блэк: \"Кто это к нам пожаловал! Посмотри-ка туды... туда! К свиньям! Тот тоже бросал мне вызов, Агрх!\" " << endl;
    Sleep(3000);
    cout << "\t            <<Пираты смеются!>> " << endl;
    Sleep(5000);
    cout << "\n\tКорсар Смит: \"Не сомневаюсь, один из нас точно устроится там поудобнее. Приступим?\" " << endl;
    Sleep(5000);
    cout << "\n\n\tКорсар Смит (про себя): \"Да поможет мне бог!\" " << endl;
    Sleep(20000);
    system("cls");

    do
    {
        cout << "----------------------------------------------------------Корсары! Игра в кости!-----------------------------------------------------------------\n" << endl;

        cout << R"(                                                     Возможные уровни сложности игры:

                                                             1. Честная игра
                                                             2. Пират мухлюет
                                                             3. Корсар мухлюет
                                                             4. Мухлюют оба

                                                     Введите уровень сложности игры: )"; cin >> level;

        switch (level)
        {
        case 1:
            dice_pc = 11;
            change_pc = 2;
            dice_pl = 11;
            change_pl = 2;
            break;
        case 2:
            dice_pc = 7;
            change_pc = 6;
            dice_pl = 11;
            change_pl = 2;
            break;
        case 3:
            dice_pc = 11;
            change_pc = 2;
            dice_pl = 7;
            change_pl = 6;
            break;
        case 4:
            dice_pc = 7;
            change_pc = 6;
            dice_pl = 7;
            change_pl = 6;
            break;
        default:
            cout << "\n                                                     Введите корректный уровень сложности!" << endl;
            Sleep(3000);
            system("cls");
            break;
        }
    } while (level < 1 || level>4);
    do
    {
        system("cls");
        cout << "----------------------------------------------------------Корсары! Игра в кости!-----------------------------------------------------------------" << endl;
        cout << "\n                                                     Пират Блэк: \"Внеси пиастры на бочку! При ставке 0 можешь выйти из игры.\" "; cin >> cash;
        if (cash < 0)cout << "\n                                                     Пират Блэк: \"Хаp! Карманы дырявые, нищее отребье!\"" << endl;
    } while (cash < 0);

    if (cash == 0)
    {
        cout << "\n                                                     Пират Блэк: \"Хаp! Кошелек прохудился! Давайте-ка парни вынесем его к свиньям!\"" << endl;
        Sleep(3000);
        cout << "\n                                                     Корсар Смит: \"Только попробуйте!\"" << endl;
        Sleep(2000);
        cout << "\n                                                                                            Бах!" << endl;
        Sleep(3000);
        cout << "\n                                                     Пират Блэк: \"Ты чего разбил ром о его голову! Я бы его одной левой утер!.. Взяли!\"" << endl;
        Sleep(5000);
        Sleep(2000);
        cout << "\n                                                     Плюх!                                      Хрю-хрю!" << endl;
        Sleep(2000);
        cout << "\n                                                                              Хрю-хрю!" << endl;
        Sleep(2000);
        cout << "\n                                                                                                                    Хрю-хрю!" << endl;
    }
    else
    {
        do
        {
            system("cls");
            cout << "----------------------------------------------------------Корсары! Игра в кости!-----------------------------------------------------------------" << endl;
            cout << "\n                                                     В мешочке корсара " << cash << " пиастров!" << endl;

            do
            {
                cout << "\n                                                     Пират Блэк: \"Сколько ставишь пиастров?\" "; cin >> bet;
                if (bet < 0)
                {
                    cout << "\n                                                     Пират Блэк: \"Агрх! с баблом что худо..? Корабль ставишь?\"" << endl;
                    Sleep(3000);
                    cout << "\n                                                     Корсар Смит: \"Корабль..? Скорее отправлю тебя к морскому дьяволу!\"" << endl;
                    Sleep(3000);
                }
                if (bet > cash)cout << "\n                                                     Пират Блэк: \"Агрх, разрази меня гром! Жизнью решил расплатиться?\"" << endl;
            } while (bet<0 || bet>cash);

            if (bet == 0)
            {
                cout << "\n                                                     Пират Блэк: \"Агрх, крыса помойная! Уваливай давай отсюда!\"" << endl;
                break;
            }
            else
            {
                do
                {
                    strike_pc = rand() % dice_pc + change_pc;;
                    strike_player = rand() % dice_pl + change_pl;
                    cout << "\n                                                     У пирата выпало: ";
                    Sleep(3000);
                    switch (strike_pc)
                    {
                    case 2:
                        cout << R"(
                                                                                                                        _ _ _ 
             _ _ _                                                                                                     |     |
            |     |                                                                                                    |  *  |
            |  *  |                                                                                                    |_ _ _|
            |_ _ _|
)";
                        break;
                    case 3:
                        cout << R"(
                                                     _ _ _
                                                    |     |                                                  _ _ _
                                                    |  *  |                                                 |   * |
                                                    |_ _ _|                                                 |     |
                                                                                                            |_*_ _|
)";
                        break;
                    case 4:
                        cout << R"(
                          _ _ _
                         |   * |
                         |     |                                                    _ _ _
                         |_*_ _|                                                   |   * |
                                                                                   |     |
                                                                                   |_*_ _|
)";
                        break;
                    case 5:
                        cout << R"(
                                                                 _ _ _
                                                                |   * |                                               _ _ _
                                                                |     |                                              |   * |
                                                                |_*_ _|                                              |  *  |
                                                                                                                     |_*_ _|
)";
                        break;
                    case 6:
                        cout << R"(
                                                                                                     _ _ _
                                                                                                    |   * |
     _ _ _                                                                                          |  *  |
    |   * |                                                                                         |_*_ _|
    |  *  |
    |_*_ _|
)";
                        break;
                    case 7:
                        cout << R"(
                                         _ _ _
                                        | * * |                                                                          _ _ _
                                        | * * |                                                                         |     |
                                        |_*_*_|                                                                         |  *  |
                                                                                                                        |_ _ _|
)";
                        break;
                    case 8:
                        cout << R"(
                                                                             _ _ _
                                                                            | * * |                          _ _ _
                                                                            |     |                         | * * |
                                                                            |_*_*_|                         |     |
                                                                                                            |_*_*_|
)";
                        break;
                    case 9:
                        cout << R"(
                                                         _ _ _
                                                        | * * |
                                                        |     |                                                                _ _ _
                                                        |_*_*_|                                                               | * * |
                                                                                                                              |  *  |
                                                                                                                              |_*_*_|
)";
                        break;
                    case 10:
                        cout << R"(
             _ _ _
            | * * |
            |  *  |                                                                          _ _ _
            |_*_*_|                                                                         | * * |
                                                                                            |  *  |
                                                                                            |_*_*_|
)";
                        break;
                    case 11:
                        cout << R"(
                                                                    _ _ _
                                                                   | * * |
                                             _ _ _                 | * * |
                                            | * * |                |_*_*_|
                                            |  *  |
                                            |_*_*_|
)";
                        break;
                    case 12:
                        cout << R"(
                                                                                     _ _ _
                                                                                    | * * |                                    _ _ _
                                                                                    | * * |                                   | * * |
                                                                                    |_*_*_|                                   | * * |
                                                                                                                              |_*_*_|
)";
                        break;
                    }
                    Sleep(3000);
                    cout << "\n\n                                                     У корсара выпало: ";
                    Sleep(3000);
                    switch (strike_player)
                    {
                    case 2:
                        cout << R"(
          _ _ _                                   
         |     |                                  _ _ _
         |  *  |                                 |     |
         |_ _ _|                                 |  *  |
                                                 |_ _ _|
)";
                        break;
                    case 3:
                        cout << R"(
                                                                                                               _ _ _
                                                                                _ _ _                         |     |
                                                                               |   * |                        |  *  |
                                                                               |     |                        |_ _ _|
                                                                               |_*_ _|                            
)";
                        break;
                    case 4:
                        cout << R"(
                                                                                                                        _ _ _
                                                                                                                       |   * |
                                 _ _ _                                                                                 |  *  |
                                |     |                                                                                |_*_ _|
                                |  *  |            
                                |_ _ _|        
)";
                        break;
                    case 5:
                        cout << R"(
                                                                                                           _ _ _
                                                                                                          |     |
         _ _ _                                                                                            |  *  |
        | * * |                                                                                           |_ _ _|
        |     |
        |_*_*_|
)";
                        break;
                    case 6:
                        cout << R"(
                                                             _ _ _         
                                                            | * * |                          
                                                            |     |                           _ _ _
                                                            |_*_*_|                          |   * |
                                                                                             |     |
                                                                                             |_*_ _|       
)";
                        break;
                    case 7:
                        cout << R"(
                                                                                                                           _ _ _
                                             _ _ _                                                                        |   * |
                                            | * * |                                                                       |     |
                                            |  *  |                                                                       |_*_ _|
                                            |_*_*_|
)";
                        break;
                    case 8:
                        cout << R"(
                                                                             _ _ _                     
                                                                            |   * |                              
                                                                            |  *  |                               _ _ _
                                                                            |_*_ _|                              | * * | 
                                                                                                                 |  *  |
                                                                                                                 |_*_*_|           
)";
                        break;
                    case 9:
                        cout << R"(
   _ _ _     
  | * * |    
  | * * |    
  |_*_*_|                                             _ _ _
                                                     |   * |       
                                                     |  *  |       
                                                     |_*_ _|       
)";
                        break;
                    case 10:
                        cout << R"(
                                                                                                          _ _ _
                                                                                                         | * * |
                     _ _ _                                                                               | * * |
                    | * * |                                                                              |_*_*_|
                    |     |
                    |_*_*_|
)";
                        break;
                    case 11:
                        cout << R"(
                                                                                           _ _ _                    
                                                                                          | * * |                   
                                                                                          | * * |                    _ _ _
                                                                                          |_*_*_|                   | * * |
                                                                                                                    |  *  |
                                                                                                                    |_*_*_|
)";
                        break;
                    case 12:
                        cout << R"(
                                     _ _ _                                                  
                                    | * * |                                                  _ _ _
                                    | * * |                                                 | * * |
                                    |_*_*_|                                                 | * * |
                                                                                            |_*_*_|
)";
                        break;
                    }
                    Sleep(3000);

                    if (strike_pc == strike_player)cout << "\n                                                     Пират Блэк: \"Агрх, перекинем!\"\n" << endl;
                } while (strike_pc == strike_player);


                if (strike_pc > strike_player)
                {
                    cout << "\n                                                     Пират Блэк: \"Ветер, хар, не в твои паруса дует!\"" << endl;
                    cash -= bet;
                    cout << "\n                                                     В мешочке корсара осталось: " << cash << " пиастров!" << endl;
                }
                else
                {
                    cout << "\n                                                     Пират Блэк: \"Везет тебе чужеземец!\"" << endl;
                    cash += bet;
                    cout << "\n                                                     В мешочке корсара набралось: " << cash << " пиастров!" << endl;
                }
                if (cash == 0)
                {
                    cout << "\n                                                     Пират Блэк: \"Удача, сморю, не на твоей стороне чужестранец! Давай-ка уваливай!\"" << endl;
                    break;
                }
                Sleep(6000);
            }
        } while (cash > 0);
    }
    Sleep(8000);
}